request_retrieve_PNR.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wbs="http://xml.amadeus.com/ws/2009/01/WBS_Session-2.0.xsd" xmlns:pnr="http://xml.amadeus.com/PNRRET_17_1_1A">
   <soapenv:Header>
      <wbs:Session>
         <wbs:SessionId>?</wbs:SessionId>
         <wbs:SequenceNumber>?</wbs:SequenceNumber>
         <wbs:SecurityToken>?</wbs:SecurityToken>
      </wbs:Session>
   </soapenv:Header>
   <soapenv:Body>
      <pnr:PNR_Retrieve>
         <!--Optional:-->
         <pnr:settings>
            <pnr:options>
               <!--1 to 40 repetitions:-->
               <pnr:optionCode>?</pnr:optionCode>
            </pnr:options>
            <!--Optional:-->
            <pnr:printer>
               <!--Optional:-->
               <pnr:identifierDetail>
                  <pnr:name>?</pnr:name>
                  <!--Optional:-->
                  <pnr:network>?</pnr:network>
               </pnr:identifierDetail>
               <!--Optional:-->
               <pnr:office>?</pnr:office>
               <!--Optional:-->
               <pnr:teletypeAddress>?</pnr:teletypeAddress>
            </pnr:printer>
         </pnr:settings>
         <pnr:retrievalFacts>
            <pnr:retrieve>
               <pnr:type>?</pnr:type>
               <!--Optional:-->
               <pnr:service>?</pnr:service>
               <!--Optional:-->
               <pnr:tattoo>?</pnr:tattoo>
               <!--Optional:-->
               <pnr:office>?</pnr:office>
               <!--Optional:-->
               <pnr:targetSystem>?</pnr:targetSystem>
               <!--Optional:-->
               <pnr:option1>?</pnr:option1>
               <!--Optional:-->
               <pnr:option2>?</pnr:option2>
            </pnr:retrieve>
            <!--Optional:-->
            <pnr:reservationOrProfileIdentifier>
               <!--0 to 2 repetitions:-->
               <pnr:reservation>
                  <!--Optional:-->
                  <pnr:companyId>?</pnr:companyId>
                  <pnr:controlNumber>?</pnr:controlNumber>
                  <!--Optional:-->
                  <pnr:controlType>?</pnr:controlType>
               </pnr:reservation>
            </pnr:reservationOrProfileIdentifier>
            <!--Optional:-->
            <pnr:personalFacts>
               <pnr:travellerInformation>
                  <pnr:traveller>
                     <pnr:surname>?</pnr:surname>
                  </pnr:traveller>
                  <!--Optional:-->
                  <pnr:passenger>
                     <pnr:firstName>?</pnr:firstName>
                  </pnr:passenger>
               </pnr:travellerInformation>
               <!--Optional:-->
               <pnr:productInformation>
                  <!--Optional:-->
                  <pnr:product>
                     <pnr:depDate>?</pnr:depDate>
                     <!--Optional:-->
                     <pnr:depTime>?</pnr:depTime>
                     <!--Optional:-->
                     <pnr:arrDate>?</pnr:arrDate>
                  </pnr:product>
                  <!--Optional:-->
                  <pnr:boardpointDetail>
                     <pnr:cityCode>?</pnr:cityCode>
                  </pnr:boardpointDetail>
                  <!--Optional:-->
                  <pnr:offpointDetail>
                     <pnr:cityCode>?</pnr:cityCode>
                  </pnr:offpointDetail>
                  <!--Optional:-->
                  <pnr:company>
                     <pnr:code>?</pnr:code>
                  </pnr:company>
                  <!--Optional:-->
                  <pnr:productDetails>
                     <pnr:identification>?</pnr:identification>
                     <!--Optional:-->
                     <pnr:subtype>?</pnr:subtype>
                  </pnr:productDetails>
               </pnr:productInformation>
               <!--Optional:-->
               <pnr:ticket>
                  <pnr:airline>?</pnr:airline>
                  <pnr:ticketNumber>?</pnr:ticketNumber>
               </pnr:ticket>
            </pnr:personalFacts>
            <!--Optional:-->
            <pnr:frequentFlyer>
               <pnr:frequentTraveller>
                  <pnr:companyId>?</pnr:companyId>
                  <pnr:membershipNumber>?</pnr:membershipNumber>
               </pnr:frequentTraveller>
            </pnr:frequentFlyer>
            <!--Optional:-->
            <pnr:accounting>
               <pnr:account>
                  <pnr:number>?</pnr:number>
               </pnr:account>
            </pnr:accounting>
         </pnr:retrievalFacts>
      </pnr:PNR_Retrieve>
   </soapenv:Body>
</soapenv:Envelope>